app/Helpers/Helper.php

    public static function checkChecklistDisplayAccess($checklist)
    {
        $accessArr = [];
        $checklistObject = ObjectItem::where('type', 'checklist')->where('id', $checklist)->with('checklistSecurity', 'responsible', 'attendee')->first();
        if(isset($checklistObject) && !empty($checklistObject)) {
            if(isset($checklistObject->checklistSecurity->is_public) && $checklistObject->checklistSecurity->is_public == 1) {
                $accessArr = User::select('id')->pluck('id')->toArray();
---
select * from `attendee` where `attendee`.`object_id` in (271)
select * from `responsible` where `responsible`.`object_id` in (271)
select `id` from `users`

    public static function checkReportDisplayAccess($report)
    {
        $accessArr = [];
        $accessTestArr = [];
        $reportObject = Report::where('id', $report)->with('reportSecurity')->first();
        if(isset($reportObject) && !empty($reportObject)) {
            if(isset($reportObject->reportSecurity->is_public) && $reportObject->reportSecurity->is_public == 1) {
                $accessArr = User::select('id')->pluck('id')->toArray();
            } else {
                $accessArr = isset($reportObject->reportSecurity->added_by) ? [$reportObject->reportSecurity->added_by, 2] : [2];
                if(isset($reportObject->reportSecurity->employee_array) && !empty($reportObject->reportSecurity->employee_array)) {
                    $reportObject->reportSecurity->employee_array = str_replace('"', '', $reportObject->reportSecurity->employee_array);
                    $employee_array = isset($reportObject->reportSecurity->employee_array) ? json_decode($reportObject->reportSecurity->employee_array) : [];
                    $accessArr = array_merge($accessArr, $employee_array);
                }
            }
            $taskObject = ObjectItem::where('type', 'task')->where('source', 'report')->where('source_id', $report)->with('responsible', 'attendee')->get();
---
select * from `reports` where `id` = 1 limit 1
select `id` from `users`
select * from `attendee` where `attendee`.`object_id` in (623)
select * from `responsible` where `responsible`.`object_id` in (623)


                }

            $riskObject = ObjectItem::where('type', 'risk-analysis')->where('source', 'report')->where('source_id', $report)->with('riskAnalysisSecurity', 'responsible', 'attendee')->get();
                if(isset($riskObject) && !empty($riskObject)) {
                    foreach ($riskObject as $key => $risk) {
                        if(isset($risk->riskAnalysisSecurity->is_public) && $risk->riskAnalysisSecurity->is_public == 1) {
                            $accessTestArr = User::select('id')->pluck('id')->toArray();
---
select * from `attendee` where `attendee`.`object_id` in (646)
select * from `responsible` where `responsible`.`object_id` in (646)
select `id` from `users`

                            $responsible_employee_array = isset($risk->responsible->employee_array) ? json_decode($risk->responsible->employee_array) : [];
                            $accessTestArr = array_merge($accessTestArr, $responsible_employee_array);
                        }
                        $riskTaskObject = ObjectItem::where('type', 'task')->where('source', 'risk-analysis')->where('source_id', $risk->id)->with('responsible', 'attendee')->first();
---
select * from `attendee` where `attendee`.`object_id` in (503)
select * from `responsible` where `responsible`.`object_id` in (503)

    public static function checkReportTaskRiskDisplayAccess($report,$user)
    {
        $accessArr = [];
            // $taskObject = ObjectItem::where('type', 'task')->where('source', 'report')->where('source_id', $report)->with('responsible', 'attendee')->get();
            $taskRiskObject = ObjectItem::where('source', 'report')->where('source_id', $report)->with('responsible', 'attendee')->get();
                if(isset($taskRiskObject) && !empty($taskRiskObject)) {
                    foreach ($taskRiskObject as $key => $obj) {
                        if($obj->type == 'task'){
                            $attendee_info = Attendee::where('object_id', $obj->id)->latest()->first();
                                if(isset($attendee_info) && !empty($attendee_info)){
                                    $attendee_processing = AttendeeProcessing::where('attendee_id', $attendee_info->id)->where('added_by', $user->id)->first();
---
select * from `attendee` where `attendee`.`object_id` in (2410)
select * from `responsible` where `responsible`.`object_id` in (2410)
select * from `attendee` where `object_id` = 2410 order by `created_at` desc limit 1
select * from `attendee_processing` where `attendee_id` = 1037 and `added_by` = 2 limit 1