app/Http/Controllers/ChecklistOptionController.php

    public function index(Request $request)
    {
        try{
            if (!$user = $this->getAuthorizedUser('checklist', 'view', 'index', 1)) {
                return $this->responseException('This action is unauthorized.', 404);
            } else{
                $isNewChecklist = $request->isNewChecklist;
                $checkOptionsList = $request->checkOptionsList;
                $checklistID = $request->checklistID;

                $result = ChecklistOption::leftJoin('checklists', 'checklist_options.checklist_id', '=', 'checklists.id')
                    ->leftJoin('users','checklist_options.added_by','=','users.id')
                    ->where (function ($query) use ($user) {
                            if ($user['role_id'] > 1) {
                                $query->Where('checklist_options.company_id', $user['company_id'])
                                    ->orWhere('checklist_options.added_by', 1);
                            } else if ($user['role_id'] == 1) {
                                $query->where('checklist_options.added_by', 1);
                            }
                        })
---
select `checklist_options`.*, `checklists`.`name` as `checklist_id_name`, `users`.`first_name` as `added_by_first_name`, `users`.`last_name` as `added_by_last_name`, CONCAT(users.first_name, " ", users.last_name) as added_by_name from `checklist_options` left join `checklists` on `checklist_options`.`checklist_id` = `checklists`.`id` left join `users` on `checklist_options`.`added_by` = `users`.`id` where (`checklist_options`.`company_id` = 1 or `checklist_options`.`added_by` = 1) and `checklist_options`.`checklist_id` = '339' order by `checklist_options`.`id` desc

                if ($checklistID) {
                    $result = $result->where('checklist_options.checklist_id', $checklistID);
                }
                $result = $result->with(['optionAnswers'])->orderBy('checklist_options.id','desc')
                    ->get();
---
select * from `checklist_options` where `checklist_id` is null order by `checklist_options`.`id` desc