app/Http/Controllers/CompanyController.php

select sum(`file_size`) as aggregate from `documents_new` left join `documents_attachments` on `documents_new`.`id` = `documents_attachments`.`document_id` where `company_id` = '1' and `delete_status` = 0
select sum(`attachment_size`) as aggregate from `repositories` where `company_id` = '1' and `attachment_uri` is not null and `restore_date` is null
select * from `employees` left join `users` on `employees`.`user_id` = `users`.`id` where `users`.`company_id` = '1' and `employees`.`disable_status` = 0
---
                //                $storageUpload = Document::where('company_id', $id)
                //                    ->where('delete_status', 0)
                //                    ->sum('file_size');
                $storageUpload = DocumentNew::leftJoin('documents_attachments', 'documents_new.id', 'documents_attachments.document_id')
                    ->where('company_id', $id)
                    ->where('delete_status', 0)
                    ->sum('file_size');

                $storageRepo = Repository::where('company_id', $id)
                    ->whereNotNull('attachment_uri')
                    ->whereNull('restore_date')
                    ->sum('attachment_size');

                $numberOfEmployee = Employee::leftJoin('users', 'employees.user_id','=', 'users.id')
                    ->where('users.company_id', $id)
                    ->where('employees.disable_status', 0)
                    ->get()
                    ->count();