app/Http/Controllers/ConnecToController.php

select * from `connect_to` where `company_id` = 1 and `object_id` = '2408'
---
    public function getByObject(Request $request)
    {
        try{
            if (!$user = JWTAuth::parseToken()->authenticate()) {
                return $this->responseException('This action is unauthorized.', 404);
            } else {
                $type = $request->type;
                $id = $request->objectID;

                $result = ConnectTo::where('company_id', $user['company_id']);
                if ($type == 'document') {
                    $result = $result->where('document_id', $id);
                } else {
                    $result = $result->where('object_id', $id);
                }
                $result = $result->get();