app/Http/Controllers/Controller.php

    public function getSecurityObject($objectType, $objectData)
    {
        $security = Security::where('object_type', $objectType)
        ->where('object_id', $objectData['id'])
        ->first();
---
select * from `security` where `object_type` = 'checklist' and `object_id` = 2408 limit 1