app/Http/Controllers/EmailLogController.php

    public function index()
    {
        try {
            if (!$user = JWTAuth::parseToken()->authenticate()) {
                return $this->responseException('Not found user', 404);
            }
            if ($user->role->level > 1 && $user->role->level < 4) {
                return $this->responseException('This action is unauthorized.', 404);
            }
            if($user->role->level === 0 || $user->role->level === 4 ){
                $emailLogs = EmailLog::with('company')->where('for_admin',1)->get();
            }else{
                $company = $user->company;
                $emailLogs = EmailLog::with('company')->where('for_company',1)->where('company_id',$company->id)->get();
---
select * from `companies` where `companies`.`id` in (1)
select * from `email_logs` where `for_company` = 1 and `company_id` = 1