app/Http/Controllers/JobTitleController.php

    public function index(Request $request)
    {
        try{
            if (!$user = $this->getAuthorizedUser('job title', 'view', 'index', 1)) {
                return $this->responseException('This action is unauthorized.', 404);
            } else {
                $getByDepartment = (int)$request->department_id;
                $getExceptUserLogged = $request->getDefineGroup;
                $getResourceByRole = $request->getResourceByRole;
                $result = JobTitle::leftJoin('roles', 'job_titles.role_id','=', 'roles.id');
                if ($user['role_id'] == 1) {
                    $result = $result->whereNull('job_titles.company_id');
                } else {
                    if ($getResourceByRole) {
                        $result = $result->whereNull('job_titles.company_id')
                            ->whereRaw('FIND_IN_SET(?, job_titles.industry_id)', [$user['company']['industry_id']])
                            ->where('job_titles.role_id', $getResourceByRole);
                    } else {
                        $result = $result->where('job_titles.company_id', $user['company_id']);
                        if ($getByDepartment) {
                            $result = $result->whereJsonContains('department', $getByDepartment);
                        }
                        if ($getExceptUserLogged) {
                            $result = $result->where('job_titles.id', '<>', $user->employee->job_title_id);
                        }
                    }
                }
                $result = $result->select('job_titles.*', 'roles.id as role_id', 'roles.name as role_name')
                    ->get();
---
select `job_titles`.*, `roles`.`id` as `role_id`, `roles`.`name` as `role_name` from `job_titles` left join `roles` on `job_titles`.`role_id` = `roles`.`id` where `job_titles`.`company_id` = 1