app/Http/Controllers/NotificationController.php

    public function index(Request $request)
    {
        try{
            if (! $user = JWTAuth::parseToken()->authenticate()) {
                return $this->responseException('Not found user', 404);
            }else{
                $getBy = $request->getBy;
                $getLastest = $request->getLastest;
                $getShowAction = $request->getShowAction;
                if (!empty($getBy) && $getBy == 'user') {
                    $result = Notification::where('user_id', $user['id']);
                    if ($getShowAction) {
                        $result = $result->where('show_action', 1)
                            ->with(['notification_content' => function($query) use($user){
                                $query->with(['message']);
                            }]);
                    } else {
                        $result = $result->with(['notification_content' => function($query) use($user){
                            $query->with(['message']);
                        }]);
                    }
                    $result = $result->orderBy('created_at', 'desc');
                    if (!empty($getLastest)) {
                        $result = $result->limit($getLastest);
                    }
                    $result = $result->get();

                } else {
                    $result = Notification::with(['notification_content' => function($query) use($user){
                        $query->where('company_id', $user['company_id'])->with(['message']);
                    }])->orderBy('created_at', 'desc')->get();
---
select * from `notifications` where `user_id` = 2 and `show_action` = 1 order by `created_at` desc
select * from `messages` where `messages`.`id` in (1, 2)

    public function countUnRead(Request $request)
    {
        try{
            if (! $user = JWTAuth::parseToken()->authenticate()) {
                return $this->responseException('Not found user', 404);
            }else{
                $getBy = $request->getBy;
                if (!empty($getBy) && $getBy == 'user') {
                    $result = Notification::where('user_id', $user['id'])->where('read_status', 0)->count();
---
select count(*) as aggregate from `notifications` where `user_id` = 2 and `read_status` = 0