app/Http/Controllers/ReportController.php

select * from `users` where `users`.`id` in (2, 3)
---
    public function index(Request $request)
    {
        try{
            // if (!$user = $this->getAuthorizedUser('report checklist', 'view', 'index', 1))
            if (!$user = JWTAuth::parseToken()->authenticate()) {
                return $this->responseException('This action is unauthorized.', 404);
            } else {
                $checkPermission = $request->checkPermission;
                $limit = $request->getLimit;
                $orderBy = $request->getOrderBy;
                $resultIds = Report::pluck('id')->toArray();
                $resultIds = array_filter($resultIds, function ($id) use ($user){
                    return in_array($user->id, Helper::checkReportDisplayAccess($id));
                });
                if ($checkPermission == 'allow'){
                    $result = Report::where('company_id', $user->company_id)
                        ->whereIn('id',$resultIds)
                        ->with([ 'user']);

                } else {
                    $result = Report::where('added_by', $user['id'])
                        ->whereIn('id',$resultIds)
                        ->with([ 'user']);
                }
                if(!empty($request->startDate) && !empty($request->endDate)){
                    $from = date('Y-m-d',strtotime($request->startDate));
                    $to = date('Y-m-d',strtotime($request->endDate));
                    $result->whereBetween('reports.created_at', [$from.' 00:00:00',$to.' 23:59:59']);
                }
                if(!empty($request->reported_by)){
                    $result->where('reports.added_by',$request->reported_by);

select * from `checklists` where `id` = 339 limit 1
---
                    // $result = $this->filterViewList('report checklist', $user, $user->filterBy, $result, $orderBy, $limit);
                    foreach ($result as $report){
                        if(!empty($report->checklist_id)){
                            $public = Checklist::where('id', $report->checklist_id)->first();

select `first_name`, `last_name` from `users` where `id` = 2 limit 1
select * from `attendee` where `attendee`.`object_id` in (2410)
select * from `responsible` where `responsible`.`object_id` in (2410)
---

                        $report->category = CategoryV2::find($report['category_id']);

                        $reportedUser = User::where('id',$report['added_by'])->select('first_name','last_name')->first();
                        $report->added_by_name = $reportedUser['first_name'] . " " . $reportedUser['last_name'];

                        $responsibleUser = User::where('id',$report['responsible'])->select('first_name','last_name')->first();
                        $report->responsible_name = $responsibleUser['first_name'] . " " . $responsibleUser['last_name'];
                        $taskIds = Helper::checkReportTaskRiskDisplayAccess($report->id,$user);
                        // if($user->role_id == 4){
                            $objectData = ObjectItem::whereIn('id',$taskIds)->where('type', 'task')->with(['attendee', 'responsible', 'time'])->get();

select * from `attendee` where `object_id` = 2364 order by `created_at` desc limit 1
---
                                foreach($objectData as $object){
                                    $dateTimeObj = $this->getDateTimeBasedOnTimezone($object, $user);
                                    $status = $this->getObjectStatus($object,$dateTimeObj);
                                    $attendee_info = Attendee::where('object_id', $object->id)->latest()->first();

select * from `attendee_processing` where `attendee_id` = 1008 and `added_by` = 2 limit 1
---
                                    }

                                    if((isset($attendee_info) && !empty($attendee_info)) && !$is_self_rs_and_ca) {
                                            $attendee_processing = AttendeeProcessing::where('attendee_id', $attendee_info->id)->where('added_by', $user->id)->first();

select * from `attendee` where `attendee`.`object_id` in (2410)
select * from `responsible` where `responsible`.`object_id` in (2410)
---
                                }
                            } else {
                                // if($user->role_id == 4){
                                    $ObjData = ObjectItem::whereIn('id',$taskIds)->where('type', 'task')->with(['attendee', 'responsible', 'time'])->first();

select * from `attendee` where `object_id` = 2410 order by `created_at` desc limit 1
---
                                $dateTimeObj = $this->getDateTimeBasedOnTimezone($ObjData, $user);

                                $status = $this->getObjectStatus($ObjData,$dateTimeObj);
                                $attendee_info = Attendee::where('object_id', $ObjData['id'])->latest()->first();

select * from `attendee_processing` where `attendee_id` = 1037 and `added_by` = 2 limit 1
---


                                if((isset($attendee_info) && !empty($attendee_info)) && !$is_self_rs_and_ca) {
                                        $attendee_processing = AttendeeProcessing::where('attendee_id', $attendee_info->id)->where('added_by', $user->id)->first();

select * from `users` where `company_id` = 1
---
    private function getObjectTimeInfo($objectData, $userLogin)
    {
        $users = User::where('company_id', $objectData['company_id'])->get();