app/Http/Controllers/RoleController.php

select * from `roles` where `level` > 1
---
    public function index(Request $request)
    {
        try{
            if (! $user = JWTAuth::parseToken()->authenticate()) {
                return $this->responseException('Not found user', 404);
            } else {
                $isHelpSetting = $request->isHelpSetting;
                if ($user['role_id'] === 1) { //super admin
                    if ($isHelpSetting) { //Help center: get all roles
                        $result = Role::where('id', '<>', 2)->get();
                    } else {
                        $result = Role::where('level', '>', 0)->get();
                    }
                } else {
                    $result = Role::where('level', '>', 1)->get();