app/Http/Controllers/StatementController.php

    public function index(Request $request)
    {
        try{
            if (!$user = $this->getAuthorizedUser('statement', 'view', 'index', 1)) {
                return $this->responseException('This action is unauthorized.', 404);
            } else {
                if (!empty($request->param)) {
                    $result = [];
                    if ($request->param == 'suggestion') {
                        //Deviation
                        $deviations = Deviation::where('company_id', $user['company_id'])
                            ->where('is_suggestion', 1)
                            ->select('id', 'subject as name', 'url')
                            ->get();

                        $item['type'] = 'Deviation';
                        $item['data'] = $deviations;

                        array_push($result, $item);

                        //Task
                        $tasks = Task::where('company_id', $user['company_id'])
                            ->where('is_suggestion', 1)
                            ->select('id', 'name', 'url')
                            ->get();
---
select `id`, `subject` as `name`, `url` from `deviations` where `company_id` = 1 and `is_suggestion` = 1
select `id`, `name`, `url` from `tasks` where `company_id` = 1 and `is_suggestion` = 1

                        array_push($result, $item);

                        //Goal
                        $goals = Goal::where('company_id', $user['company_id'])
                            ->where('is_suggestion', 1)
                            ->select('id', 'name', 'url')
                            ->get();
---
select `id`, `name`, `url` from `goals` where `company_id` = 1 and `is_suggestion` = 1

                        array_push($result, $item);

                        //Routine (with format)
                        $routines = Routine::leftJoin('users', 'routines.responsible_id', '=', 'users.id')
                            ->where('routines.company_id', $user['company_id'])
                            ->where('routines.is_suggestion', 1)
                            ->select('routines.id', 'routines.name', 'routines.url', 'routines.deadline', 'routines.recurring',
                                'routines.responsible_id','users.first_name as first_name','users.last_name as last_name')
                            ->get();
---
select `routines`.`id`, `routines`.`name`, `routines`.`url`, `routines`.`deadline`, `routines`.`recurring`, `routines`.`responsible_id`, `users`.`first_name` as `first_name`, `users`.`last_name` as `last_name` from `routines` left join `users` on `routines`.`responsible_id` = `users`.`id` where `routines`.`company_id` = 1 and `routines`.`is_suggestion` = 1

                        array_push($result, $item);

                        //Instruction
                        $instructions = Instruction::where('company_id', $user['company_id'])
                            ->where('is_suggestion', 1)
                            ->select('id', 'name', 'url')
                            ->get();
---
select `id`, `name`, `url` from `instructions` where `company_id` = 1 and `is_suggestion` = 1

                        array_push($result, $item);

                        //Checklist
                        $checklists = Checklist::where('company_id', $user['company_id'])
                            ->where('is_suggestion', 1)
                            ->select('id', 'name', 'url')
                            ->get();
---
select `id`, `name`, `url` from `checklists` where `company_id` = 1 and `is_suggestion` = 1

                        array_push($result, $item);

                        //Contact
                        $contacts = Contact::where('company_id', $user['company_id'])
                            ->where('is_suggestion', 1)
                            ->select('id', 'name', 'url')
                            ->get();
---
select `id`, `name`, `url` from `contacts` where `company_id` = 1 and `is_suggestion` = 1

                        array_push($result, $item);

                        //Risk area
                        $riskElementSources = RiskElementSource::where('company_id', $user['company_id'])
                            ->where('is_suggestion', 1)
                            ->select('id', 'name', 'url')
                            ->get();
---
select `id`, `name`, `url` from `risk_element_sources` where `company_id` = 1 and `is_suggestion` = 1

                        array_push($result, $item);

                        //Report checklist
                        $reports = Report::where('company_id', $user['company_id'])
                            ->where('is_suggestion', 1)
                            ->select('id', 'url')
                            ->get();
---
select `id`, `url` from `reports` where `company_id` = 1 and `is_suggestion` = 1

                        array_push($result, $item);

                        //Report analysis
                        $riskAnalysis = RiskAnalysis::where('company_id', $user['company_id'])
                            ->where('is_suggestion', 1)
                            ->select('id', 'name', 'url')
                            ->get();
---
select `id`, `name`, `url` from `risk_analysis` where `company_id` = 1 and `is_suggestion` = 1

                            ->get()->toArray();


                        $userTasks = UserTask::where('responsible_id', $user->id)->get();
---
select * from `user_tasks` where `responsible_id` = 2

                        }
                    }
                } else {
                    $result = Statement::where(function ($q) use ($user) {
                        if ($user->role_id > 1) {
                            $q->where('company_id', $user['company_id'])
                                ->orWhere('added_by', 1);
                        } else if ($user->role_id == 1) {
                            $q->where('added_by', 1);
                        }
                    })
                        ->where('delete_status', 0)
                        ->with(['user_added'])
                        ->get();
---
select * from `statements` where (`company_id` = 1 or `added_by` = 1) and `delete_status` = 0