app/Http/Controllers/SubscriptionController.php

    public function activePlan()
    {
        try {
            if (!$user = JWTAuth::parseToken()->authenticate()) {
                return $this->responseException('Not found user', 404);
            }
            $access = [];
            if ($user->role->level == 0 || $user->role->level == 4) {
                return $this->responseSuccess($access);
            }
            $subscription = Subscription::where('company_id', $user->company_id)->select('plan_detail')->whereNull('deactivated_at')->whereNull('addon_id')->first();
            $newPlanAccess = $subscription->plan_detail['plan_detail'];

            $lastSubscriptions = Subscription::where('company_id', $user->company_id)->select('plan_detail')->whereNotNull('deactivated_at')->whereNull('addon_id')->get();
---
select `plan_detail` from `subscriptions` where `company_id` = 1 and `deactivated_at` is null and `addon_id` is null limit 1
select `plan_detail` from `subscriptions` where `company_id` = 1 and `deactivated_at` is not null and `addon_id` is null