app/Http/Controllers/TaskAssigneeController.php

    public function index(Request $request)
    {
        try{

            if (! $user = JWTAuth::parseToken()->authenticate()) {
                return $this->responseException('Not found user', 404);
            }else{
                $checkPermission = $request->checkPermission;
                $limit = $request->getLimit;
                $orderBy = $request->getOrderBy;

                $result = TaskAssignee::leftJoin('tasks', 'task_assignees.task_id', 'tasks.id')
                    ->where ('task_assignees.company_id', $user->company_id);
                if ($checkPermission != 'allow') {
                    $result = $result->where('user_id', $user->id);
                }
                if ($orderBy) {
                    if ($orderBy == 'latest') {
                        $result = $result->latest();
                    } elseif ($orderBy == 'oldest') {
                        $result = $result->oldest();
                    }
                }
                if ($limit) {
                    $result = $result->limit($limit);
                }
                $result = $result->select('task_assignees.*', 'tasks.name', 'tasks.added_by', 'tasks.type', 'tasks.type_id')
                    ->get();
---
select `task_assignees`.*, `tasks`.`name`, `tasks`.`added_by`, `tasks`.`type`, `tasks`.`type_id` from `task_assignees` left join `tasks` on `task_assignees`.`task_id` = `tasks`.`id` where `task_assignees`.`company_id` = 1 and `user_id` = 2