app/Http/Controllers/TitleCaptionController.php

select * from `title_caption` where `title_key` = '2-documents-documents-documents' and `activate` = 1 limit 1
---
    public function showByKey(Request $request, $key)
    {
        try {
            $titleCaptionData = TitleCaption::where('title_key', $key)->where('activate', 1)->first();