app/Http/Controllers/TopicController.php

select * from `questions` where `questions`.`topic_id` in (427)
select * from `topics` where `checklist_id` = '339'
select * from `checklist_options` where `id` = 303 limit 1
select * from `checklist_option_answers` where `default_option_id` = 303
---
    public function index(Request $request)
    {
        try{

            if (! $user = JWTAuth::parseToken()->authenticate()) {
                return $this->responseException('Not found user', 404);
            }else{
                $checklist = $request->checklist;
                if($checklist){
                    $result = Topic::where('checklist_id', $checklist)
                        ->with(['questions'])
                        ->get();
                }else{
                    $result = Topic::where('company_id', $user -> company_id)
                        ->get();
                }

                if($result){
                    foreach ($result as $topic) {
                        if (!empty($topic['questions'])) {
                            foreach ($topic['questions'] as $question) {
                                $dataCheck = ChecklistOption::where("id", $question['default_option_id'])->first();
                                $question->type_of_option_answer = $dataCheck['type_of_option_answer'] ?? '';
                                $question->option_name = $dataCheck['name'] ?? '';
                                $question->option_answers = ChecklistOptionAnswer::where("default_option_id", $question['default_option_id'])
                                    ->get();