app/Http/Controllers/UserController.php

select * from `settings` where `key` = 'freezing_system' and `is_disabled` = 1 limit 1
select * from `roles` where `roles`.`id` = 2 limit 1
select * from `settings` where `key` = 'freezing_days' and `is_disabled` = 1 limit 1
select * from `billings` where `billings`.`subscription_id` = 20 and `billings`.`subscription_id` is not null limit 1
select * from `billing_details` where `billing_details`.`billing_id` = 70 and `billing_details`.`billing_id` is not null limit 1
---
    public function me()
    {
        if (!$user = JWTAuth::parseToken()->authenticate()) {
            return response()->json(['user_not_found'], 404);
        }
        $user->role_name = $user->role->name;

        if ($user->role_id == 1 || $user->role_id == 5) {
            return $this->responseSuccess($user);
        }
        // billing module
        if (count($user->company->subscriptions) == 0) {
            $user['subscription_message'] = 'User no subscription';
            return $this->responseSuccess($user);
        }
        $freezingSystem = Setting::where('key', 'freezing_system')->where('is_disabled', 1)->first();
        if ($freezingSystem) {
            if (($user->role->level === Role::COMPANY_ROLE_LEVEL || $user->role->level === Role::MANAGER_ROLE_LEVEL || $user->role->level === Role::USER_ROLE_LEVEL) && $freezingSystem->value === 'manually' && $user->company->is_freeze) {
                $user['subscription_message'] = 'Admin has freeze system for your company due to unpaid invoice';
                return $this->responseSuccess($user);
            }
            if (($user->role->level === Role::COMPANY_ROLE_LEVEL || $user->role->level === Role::MANAGER_ROLE_LEVEL || $user->role->level === Role::USER_ROLE_LEVEL) && $user->company->subscriptions &&  $freezingSystem->value === 'automatic') {
                $subscriptions = $user->company->subscriptions;
                foreach ($subscriptions as $subscription) {
                    $today = Carbon::now();
                    if ($subscription && $subscription->billing && (!$subscription->trial_end_at || Carbon::parse($subscription->trial_end_at) < $today) && !$subscription->cancelled_at) {
                        $billingDate = Carbon::parse($subscription->billed_at);

                        $status = $subscription->billing->billingDetail->status;
                        $freezingDays = Setting::where('key', 'freezing_days')->where('is_disabled', 1)->first();
                        if ($freezingDays && $status == BillingDetail::PENDING && Carbon::parse($billingDate)->diffInDays($today) > $freezingDays->value) {